[
  { "text": "I love this F1 season, the battles are amazing!", "label": "positive" },
  { "text": "Max’s last overtake was incredible, what a driver!", "label": "positive" },
  { "text": "The strategy from Ferrari today was really smart and exciting.", "label": "positive" },
  { "text": "I’m so happy with McLaren’s performance this weekend.", "label": "positive" },
  { "text": "The race was full of action, safety cars and overtakes, I enjoyed every lap.", "label": "positive" },
  { "text": "احب سباقات الفورمولا 1 خصوصاً لما يكون في منافسة قوية على المركز الأول.", "label": "positive" },
  { "text": "انبهرت من استراتيجية تبديل الإطارات اليوم، كانت حركة ذكية جداً.", "label": "positive" },
  { "text": "The new circuit layout looks fun and I’m excited for the next race.", "label": "positive" },
  { "text": "Great job from the team, the pit stops were fast and clean.", "label": "positive" },
  { "text": "I really love F1, it’s the only sport I never miss on weekends.", "label": "positive" },

  { "text": "The last race was boring, nothing really happened.", "label": "negative" },
  { "text": "I’m disappointed with the constant team mistakes in strategy.", "label": "negative" },
  { "text": "The car pace was terrible today, no overtakes and no fight.", "label": "negative" },
  { "text": "Too many penalties and rules ruined the race for me.", "label": "negative" },
  { "text": "I hate how predictable the podium has become this season.", "label": "negative" },
  { "text": "آخر سباق كان ممل جداً، ما في تجاوزات ولا أي إثارة.", "label": "negative" },
  { "text": "أخطاء الفريق في تغيير الإطارات خربت السباق بالكامل.", "label": "negative" },
  { "text": "The DRS train made the race feel very slow and frustrating.", "label": "negative" },
  { "text": "Fans waited all weekend and the race ended with no real action.", "label": "negative" },
  { "text": "I’m tired of the same mistakes every weekend, it’s frustrating to watch.", "label": "negative" },

  { "text": "Max started from pole and finished first, it was a normal race.", "label": "neutral" },
  { "text": "The race had one safety car and a few pit stops, nothing special happened.", "label": "neutral" },
  { "text": "Today’s Grand Prix was okay, not the best and not the worst.", "label": "neutral" },
  { "text": "Both drivers finished in the points with a standard strategy.", "label": "neutral" },
  { "text": "The weather was stable and most teams followed a one-stop strategy.", "label": "neutral" },
  { "text": "السباق كان عادي، مو سيء جداً ولا ممتاز، مجرد سباق متوسط.", "label": "neutral" },
  { "text": "انتهى السباق بدون حوادث كبيرة ومعظم الفرق استخدمت نفس الاستراتيجية.", "label": "neutral" },
  { "text": "Qualifying was straightforward and the grid stayed similar in the race.", "label": "neutral" },
  { "text": "The midfield battle was fine but nothing shocking or surprising.", "label": "neutral" },
  { "text": "It felt like a standard F1 weekend with a typical race result.", "label": "neutral" }
]
